
&НаКлиенте
Процедура РасчетНаименованиеТовараПриИзменении(Элемент)
	тд = Элементы.Расчет.ТекущиеДанные;
	тд.Цена = ПолучитьЦену (тд.НаименованиеТовара);
КонецПроцедуры

 &НаСервереБезКонтекста
 Функция ПолучитьЦену (Наименование)
	 Возврат Наименование.Цена;
 КонецФункции

&НаКлиенте
 Процедура РасчетКоличествоПриИзменении(Элемент)
	 тд = Элементы.Расчет.ТекущиеДанные;
	 тд.СуммаБезНДС = тд.Количество * тд.Цена;
 КонецПроцедуры

&НаКлиенте
 Процедура РасчетЦенаПриИзменении(Элемент)
	 тд = Элементы.Расчет.ТекущиеДанные;
	 тд.СуммаБезНДС = тд.Количество * тд.Цена;
 КонецПроцедуры

&НаКлиенте
 Процедура РасчетНДСПриИзменении(Элемент)
	 тд = Элементы.Расчет.ТекущиеДанные;
	 тд.СуммаСНДС = тд.СуммаБезНДС - (тд.СуммаБезНДС * тд.НДС / 100);
 КонецПроцедуры
