
&НаКлиенте
Процедура ЗакупТовараКоличествоПриИзменении(Элемент)
	тд = Элементы.ЗакупТовара.ТекущиеДанные;
	тд.СуммаБезНДС = тд.Количество * тд.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ЗакупТовараЦенаПриИзменении(Элемент)
	тд = Элементы.ЗакупТовара.ТекущиеДанные;
	тд.СуммаБезНДС = тд.Количество * тд.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ЗакупТовараСтавкаПриИзменении(Элемент)
	тд = Элементы.ЗакупТовара.ТекущиеДанные;
	тд.СуммаСНДС = тд.СуммаБезНДС + (тд.СуммаБезНДС * тд.Ставка / 100);
КонецПроцедуры