
&НаКлиенте
Процедура РасчетЗПСотрудникПриИзменении(Элемент)
	ТекДанные = Элементы.РасчетЗП.ТекущиеДанные;
	ТекДанные.Должность = ПолучитьДолжность (ТекДанные.Сотрудник);
	ТекДанные.Оклад = ПолучитьОклад (ТекДанные.Должность);
	ТекДанные.Премия = ТекДанные.Оклад * 15/100;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДолжность (Наименование)
	Возврат Наименование.Должность;
КонецФункции

&НаКлиенте
Процедура РасчетЗПДолжностьПриИзменении(Элемент)
	ТекДанные = Элементы.РасчетЗП.ТекущиеДанные;
	ТекДанные.Оклад = ПолучитьОклад (ТекДанные.Должность);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОклад (Наименование)
	Возврат Наименование.Оклад;
КонецФункции

&НаКлиенте
Процедура РасчетЗПОтработаноДнейПриИзменении(Элемент)
	кк = Элементы.РасчетЗП.ТекущиеДанные;
	кк.ДоВычетаНДФЛ = кк.Оклад / кк.ВсегоРабочихДней * кк.ОтработаноДней + кк.Премия;
КонецПроцедуры 

&НаКлиенте
Процедура РасчетЗППремияПриИзменении(Элемент)
	кк = Элементы.РасчетЗП.ТекущиеДанные;
	кк.ДоВычетаНДФЛ = кк.Оклад / кк.ВсегоРабочихДней * кк.ОтработаноДней + кк.Премия;
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗПНДФЛПриИзменении(Элемент)
	кк = Элементы.РасчетЗП.ТекущиеДанные;
	кк.КВыплате = кк.ДоВычетаНДФЛ - кк.ДоВычетаНДФЛ * кк.НДФЛ/100;
КонецПроцедуры
